# web - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_ssm_parameter.user_pool_id: Reading...
module.common_resources.data.aws_ssm_parameter.identity_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.organization_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.customer_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.user_pool_id: Read complete after 0s [id=user_pool_id]
module.common_resources.data.aws_ssm_parameter.identity_api_endpoint: Read complete after 0s [id=identity_api_endpoint]
module.common_resources.data.aws_ssm_parameter.customer_api_endpoint: Read complete after 0s [id=customer_api_endpoint]
module.common_resources.data.aws_ssm_parameter.organization_api_endpoint: Read complete after 0s [id=organization_api_endpoint]
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Read complete after 0s [id=gateway_api_endpoint]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common_resources.aws_cognito_user_pool_client.default will be created
  + resource "aws_cognito_user_pool_client" "default" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client          = true
      + allowed_oauth_scopes                          = [
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = [
          + "http://localhost:3000/api/auth/callback/cognito",
          + "https://new-production.connectilly.com/api/auth/callback/cognito",
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = true
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret                               = true
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "production_web"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = [
          + "COGNITO",
          + "Google",
        ]
      + user_pool_id                                  = (sensitive value)
      + write_attributes                              = (known after apply)
    }

  # module.common_resources.random_password.nextauthsecret will be created
  + resource "random_password" "nextauthsecret" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 256
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.common_resources.vercel_deployment.default will be created
  + resource "vercel_deployment" "default" {
      + domains     = (known after apply)
      + files       = {
          + "../../../.eslintrc.json"                                                                 = "40~75e677e7192205173354ae9375c1d25ef78b0cec"
          + "../../../Dockerfile"                                                                     = "622~87f42718dbe51de66fa9ce8f7d13c9cd5e201091"
          + "../../../README.md"                                                                      = "1751~48b384309a1437a218793ea183aa2964b6d8d16d"
          + "../../../infrastructure/workspaces/common/outputs.tf"                                    = "217~d359eda6f62d0b7c19e390cacae394a151a04dcf"
          + "../../../infrastructure/workspaces/common/variables.tf"                                  = "169~567e81bf0a78e486c49f7ec76d8ea0655d52a648"
          + "../../../infrastructure/workspaces/common_resources/locals.tf"                           = "119~6c0bdc825d3f60d23b63a5975bae6ac36fc59097"
          + "../../../infrastructure/workspaces/common_resources/resources.tf"                        = "4464~fdf4e555498e664dee085d385a47f77efb3011d5"
          + "../../../infrastructure/workspaces/common_resources/terraform.tf"                        = "278~a530fc09a215668de7b7ad649af60c34cf085435"
          + "../../../infrastructure/workspaces/common_resources/variables.tf"                        = "85~fea626a48e22b0cb7ff8bcb67c4067d8bdd3eeb5"
          + "../../../infrastructure/workspaces/production/locals.tf"                                 = "40~fea7b9f1c9224cdac47f3656aa21f4d5fa518639"
          + "../../../infrastructure/workspaces/production/main.tf"                                   = "304~73f26b0e907ea9401851cc30c24a03b9dd6759eb"
          + "../../../infrastructure/workspaces/production/providers.tf"                              = "120~b8c1b7c4fce68a6fce4266bcffc602ec2c057eb9"
          + "../../../infrastructure/workspaces/production/terraform.tf"                              = "380~2efb3c1937ea46c5e49867e23c3f45a37ab726c0"
          + "../../../infrastructure/workspaces/production/variables.tf"                              = "208~6ef45c33ee05c6ed30ad2a99b9fdae679d8aa824"
          + "../../../infrastructure/workspaces/staging/locals.tf"                                    = "37~529b2583b0fabccefabd226db19f2b54e7743992"
          + "../../../infrastructure/workspaces/staging/main.tf"                                      = "304~73f26b0e907ea9401851cc30c24a03b9dd6759eb"
          + "../../../infrastructure/workspaces/staging/providers.tf"                                 = "120~b8c1b7c4fce68a6fce4266bcffc602ec2c057eb9"
          + "../../../infrastructure/workspaces/staging/terraform.tf"                                 = "377~86c808108a257e9f47d989d98e4f6b6706129106"
          + "../../../infrastructure/workspaces/staging/variables.tf"                                 = "208~6ef45c33ee05c6ed30ad2a99b9fdae679d8aa824"
          + "../../../next-i18next.config.js"                                                         = "83~138ceb181e0eb4c27ef445a6cc1b17b41ce52fe8"
          + "../../../next.config.js"                                                                 = "310~7795d67ccd95c9a172caded61348efa6f30946e0"
          + "../../../package.json"                                                                   = "1351~b96387ca46f16e93a4f74b631ae61f1bf8f3c962"
          + "../../../public/favicon.ico"                                                             = "10361~6aad3b7c34c152a37cfe9a847d620babf2525d81"
          + "../../../public/locales/en/common.json"                                                  = "50~07dde893ee049067c2b720cf1c7b55f0ed1605c7"
          + "../../../public/logo/logo-black.png"                                                     = "231477~adeb68423f9ebbc14276c7253aff6c47470a3d2e"
          + "../../../public/logo/logo-white.png"                                                     = "227288~30a1b153a0b326ac806327fc9f7ba67990a02ad4"
          + "../../../public/logo/logo.ico"                                                           = "10361~6aad3b7c34c152a37cfe9a847d620babf2525d81"
          + "../../../relay.config.js"                                                                = "260~a964b0222bcd08baa0417d81c47d943624d8f9b1"
          + "../../../schema/schema.graphql"                                                          = "15263~51dbe58e62cc56ab71f40b862af64e48da0f6177"
          + "../../../scripts/download-federated-schema.sh"                                           = "226~89823a2dd9c140119b674d7d14522ed52827cf11"
          + "../../../src/clients/generate.go"                                                        = "237~205a699a6cb5bbaef35ec5f86443c652e79b0aad"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/IdentityClient.ts"            = "1152~7e5ee0e1c9b90665d37693b9849ed24e830c35c3"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/core/ApiError.ts"             = "740~945196ea0e768d9ce2f1c5ac0d2c09eda0e1243e"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/core/ApiRequestOptions.ts"    = "577~2013bd376f0bde815ee25ab65383981725281f1e"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/core/ApiResult.ts"            = "236~a917641eaa2e615a77ff60fa178c927f2ed5b717"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/core/BaseHttpRequest.ts"      = "426~d7936ef7b172d50a019264c3b1d2edaf24ae9c78"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/core/CancelablePromise.ts"    = "3963~f61c713e20b332582e97f232f66bfd0bfc8fc322"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/core/FetchHttpRequest.ts"     = "770~35e2a358f2852952e7d94f4f32ad1de66b36a8b2"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/core/OpenAPI.ts"              = "862~a2bebc6da3500167296110575eb5c3d137ceed61"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/core/request.ts"              = "9539~d60f0515ee2c147d3ea3eabe070e422452f88275"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/index.ts"                     = "933~f37158ec59c97414d6b394e3db58a1817d1ab114"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/models/Error.ts"              = "206~7821983fd3495ed999afe759d81c5f85fea3ac9f"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/models/IdentityProvider.ts"   = "331~0bcde6843b81f5903f8746e025419a4892a81d40"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/models/IdentityRequest.ts"    = "479~e164eeeb6cfdc77fa0ab1aa9417b50704e1d37cc"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/models/IdentityResponse.ts"   = "130~ad685819d6a4246d8f460dcad3b7de724b8e1f75"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/schemas/$Error.ts"            = "413~26f5fee7acee4a18c4ceca4e6f5d9141a7ade0ef"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/schemas/$IdentityProvider.ts" = "442~c57e4382d6827ff24a067b74ec95385b06416ecf"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/schemas/$IdentityRequest.ts"  = "1225~b2e159cbc8fe911b9af53382eba8e5060e322935"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/schemas/$IdentityResponse.ts" = "283~24c7b94bf8a3116aa7a4173b54add5c4c0a39d87"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/services/IdentityService.ts"  = "1553~a5b17ab4b0851939139a6731af82e07336d32633"
          + "../../../src/components/layout.tsx"                                                      = "6790~babcf161e15bff02fa6924e988887c6647119f02"
          + "../../../src/components/loading/index.tsx"                                               = "407~ad1ce6d656419a7bf462fc82bcde84b8ab99d79f"
          + "../../../src/middleware.ts"                                                              = "208~380b87010c416e01dfd1fc55e757a3eea291055a"
          + "../../../src/pages/_app.tsx"                                                             = "635~fefc2d4d8576ad816d8b68b05562720557941b2b"
          + "../../../src/pages/_document.tsx"                                                        = "233~05fef3bee0e00fdb406352623cbd1b8969f9b474"
          + "../../../src/pages/api/auth/[...nextauth].ts"                                            = "2242~0c77c1d770c45fdb8f739f8f323c4b6cb8865e50"
          + "../../../src/pages/index.tsx"                                                            = "1478~a1537ab0c322a2f03af660ef9f4d0633ef6ac731"
          + "../../../src/styles/Home.module.css"                                                     = "3856~0aca80d20664c5ba5c7f3de1aa44b40c7b2d5db6"
          + "../../../src/styles/globals.css"                                                         = "2024~e3b15e17e0f8297a45df3fcb9a3a6389bae1bb48"
          + "../../../src/styles/theme/index.ts"                                                      = "171~9868a50977f7775070e3014e284068ee434994c8"
          + "../../../src/types/environment.d.ts"                                                     = "324~9447e4d5d668e37336c61e263cc574fbe4a9e443"
          + "../../../tsconfig.json"                                                                  = "556~c02e872d6e9d083d3c121b3bb392743c745f38fa"
          + "../../../yarn.lock"                                                                      = "139425~202d0103a19cd0bb80a3a7cdbdbac42f4379c5b2"
        }
      + id          = (known after apply)
      + path_prefix = "../../../"
      + production  = true
      + project_id  = (known after apply)
      + team_id     = "connectilly"
      + url         = (known after apply)
    }

  # module.common_resources.vercel_project.default will be created
  + resource "vercel_project" "default" {
      + environment                = (sensitive value)
      + framework                  = "nextjs"
      + id                         = (known after apply)
      + name                       = "production-web"
      + serverless_function_region = (known after apply)
      + team_id                    = "connectilly"
    }

  # module.common_resources.vercel_project_domain.default will be created
  + resource "vercel_project_domain" "default" {
      + domain     = "new-production.connectilly.com"
      + id         = (known after apply)
      + project_id = (known after apply)
      + team_id    = "connectilly"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*